Revit 2026 API

# RevisionCreate Method

---

Creates a new Revision in the project.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Revision Create(
	Document document
)
```
```vb
Public Shared Function Create (
	document As Document
) As Revision
```
```cpp
public:
static Revision^ Create(
	Document^ document
)
```
```fsharp
static member Create :
        document : Document -> Revision
```

#### Parameters

document Document
     The document of the new Revision.

#### Return Value

Revision The newly created Revision.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non-optional argument was null |

The new Revision will be added at the end of the sequence of existing Revisions.

#### Reference

Revision Class

Autodesk.Revit.DB Namespace